Revit 2027 API
ACADExportOptions.LineScaling Property
 The scaling mode for the line type. Default value is LineScaling.ViewScale.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LineScaling LineScaling { get; set; }
Public Property LineScaling As LineScaling
	Get
	Set
public:
property LineScaling LineScaling {
	LineScaling get ();
	void set (LineScaling value);
}
member LineScaling : LineScaling with get, set
Property Value
LineScaling
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ACADExportOptions Class
Autodesk.Revit.DB Namespace